chore: release v1.3.1 [skip ci]
